ERP.belugaerp/src/Catalogs/ТоварныеКатегории/ТоварныеКатегории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварныеКатегории</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_Апелласьон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Бренд</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_БрендКУ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_БрендыКУ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Вкус</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_Вкусы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВПодарочнойУпаковке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Выбыл</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДегустационныеХарактеристики</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Добавлен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДоляСпирта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДоляСпиртаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КатегорияВладельца</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_КатегорияВладельца</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КатегорияМотивации</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_КатегорияМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Класс</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНСИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НаименованиеПоСертификатуАнг</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НаименованиеПоСертификатуРус</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НаЭкспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Объем</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_Объемы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Предшественник</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПромоНаборСобственнойСборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_РегионПроисхождения</name>
    <type>
      <types>CatalogRef.бг_РегионыПроисхождения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Рейтинги</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СкюМТ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_СкюМТ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СортовойСостав</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Состояние</name>
    <type>
      <types>EnumRef.бг_СостоянияТоварныхКатегорий</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Статус</name>
    <type>
      <types>CatalogRef.бг_СтатусыТоварныхКатегорий</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/ТоварныеКатегории/Forms/ФормаЭлемента/Module.bsl
#Область бг_ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	бг_ВывестиПоляЕКSKU();
	бг_ВидимостьПолябг_ДоляСпиртаДо();
	бг_УстановитьАвтоОтметкуНезаполненногоВкус()
	
КонецПроцедуры

&НаСервере
Процедура бг_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	
	Элемент = Элементы.Найти("бг_ДоляСпиртаДо");
	
	Если Элемент <> Неопределено Тогда
		бг_ВидимостьПолябг_ДоляСпиртаДо(ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура бг_КлассПриИзменении(Элемент)
	
	бг_ВидимостьПолябг_ДоляСпиртаДо();
	бг_УстановитьАвтоОтметкуНезаполненногоВкус()
	
КонецПроцедуры

&НаКлиенте
Процедура бг_БрендПриИзменении(Элемент)
	
	бг_БрендПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область бг_СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ВывестиПоляЕКSKU()
	
	бг_НаименованиеПоСертификатуРус = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_НаименованиеПоСертификатуРус",
		, //Родитель
		"Объект.бг_НаименованиеПоСертификатуРус");
	бг_НаименованиеПоСертификатуРус.МаксимальнаяШирина = 30;
	
	бг_НаименованиеПоСертификатуАнг = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_НаименованиеПоСертификатуАнг",
		, //Родитель
		"Объект.бг_НаименованиеПоСертификатуАнг");
	бг_НаименованиеПоСертификатуАнг.МаксимальнаяШирина = 30;
	
	бг_ГруппаРеквизитыНСИ = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
		ЭтотОбъект,
		"бг_ГруппаРеквизитыНСИ",
		ЭтотОбъект);
	бг_ГруппаРеквизитыНСИ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	бг_ГруппаРеквизитыНСИ.ОтображатьЗаголовок = Ложь;
	
	#Область бг_ГруппаЛево
	
	бг_ГруппаРеквизитыНСИЛево = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
		ЭтотОбъект,
		"бг_ГруппаРеквизитыНСИЛево",
		бг_ГруппаРеквизитыНСИ);
	бг_ГруппаРеквизитыНСИЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	бг_ГруппаРеквизитыНСИЛево.ОтображатьЗаголовок = Ложь;
	
	// Группа "Номенклатурная группа"
	бг_ГруппаНоменклатурнаяГруппа = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
		ЭтотОбъект,
		"бг_ГруппаНоменклатурнаяГруппа",
		бг_ГруппаРеквизитыНСИЛево);
	бг_ГруппаНоменклатурнаяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	бг_ГруппаНоменклатурнаяГруппа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	бг_ГруппаНоменклатурнаяГруппа.Заголовок = НСтр("ru = 'Номенклатурная группа'");
	бг_ГруппаНоменклатурнаяГруппа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	
	бг_НоменклатурнаяГруппа = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_НоменклатурнаяГруппа",
		бг_ГруппаНоменклатурнаяГруппа,
		"Объект.бг_НоменклатурнаяГруппа");
	бг_НоменклатурнаяГруппа.АвтоМаксимальнаяШирина = Ложь;
	бг_НоменклатурнаяГруппа.МаксимальнаяШирина = 28;
	
	бг_НоменклатурнаяГруппаТипВина = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_НоменклатурнаяГруппаТипВина",
		бг_ГруппаНоменклатурнаяГруппа,
		"Объект.бг_НоменклатурнаяГруппа.ТипВина");
	бг_НоменклатурнаяГруппаТипВина.АвтоМаксимальнаяШирина = Ложь;
	бг_НоменклатурнаяГруппаТипВина.МаксимальнаяШирина = 28;
	
	бг_НоменклатурнаяГруппаВид = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_НоменклатурнаяГруппаВид",
		бг_ГруппаНоменклатурнаяГруппа,
		"Объект.бг_НоменклатурнаяГруппа.Вид");
	бг_НоменклатурнаяГруппаВид.АвтоМаксимальнаяШирина = Ложь;
	бг_НоменклатурнаяГруппаВид.МаксимальнаяШирина = 28;
	
	бг_НоменклатурнаяГруппаЦвет = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_НоменклатурнаяГруппаЦвет",
		бг_ГруппаНоменклатурнаяГруппа,
		"Объект.бг_НоменклатурнаяГруппа.Цвет");
	бг_НоменклатурнаяГруппаЦвет.АвтоМаксимальнаяШирина = Ложь;
	бг_НоменклатурнаяГруппаЦвет.МаксимальнаяШирина = 28;
	
	// Группа "Описание"
	бг_ГруппаОписание = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
		ЭтотОбъект,
		"бг_ГруппаОписание",
		бг_ГруппаРеквизитыНСИЛево);
	бг_ГруппаОписание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	бг_ГруппаОписание.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	бг_ГруппаОписание.Заголовок = НСтр("ru = 'Описание'");
	бг_ГруппаОписание.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	
	бг_Бренд = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Бренд",
		бг_ГруппаОписание,
		"Объект.бг_Бренд");
	бг_Бренд.АвтоМаксимальнаяШирина = Ложь;
	бг_Бренд.МаксимальнаяШирина = 28;
	
	бг_Бренд.УстановитьДействие("ПриИзменении", "бг_БрендПриИзменении");
	
	бг_Вкус = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Вкус",
		бг_ГруппаОписание,
		"Объект.бг_Вкус");
	бг_Вкус.АвтоМаксимальнаяШирина = Ложь;
	бг_Вкус.МаксимальнаяШирина = 28;
	
	бг_Класс = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Класс",
		бг_ГруппаОписание,
		"Объект.бг_Класс");
	бг_Класс.АвтоМаксимальнаяШирина = Ложь;
	бг_Класс.МаксимальнаяШирина = 28;
	
	бг_Класс.УстановитьДействие("ПриИзменении", "бг_КлассПриИзменении");
	
	бг_Апелласьон = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Апелласьон",
		бг_ГруппаОписание,
		"Объект.бг_Апелласьон");
	бг_Апелласьон.АвтоМаксимальнаяШирина = Ложь;
	бг_Апелласьон.МаксимальнаяШирина = 32;
	бг_Апелласьон.МногострочныйРежим = Истина;
	бг_Апелласьон.РастягиватьПоВертикали = Ложь;
	
	#КонецОбласти
	
	#Область бг_ГруппаПраво
	
	// Группа реквизиты ПРАВО
	бг_ГруппаРеквизитыНСИПраво = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
		ЭтотОбъект,
		"бг_ГруппаРеквизитыНСИПраво",
		бг_ГруппаРеквизитыНСИ);
	бг_ГруппаРеквизитыНСИПраво.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	бг_ГруппаРеквизитыНСИПраво.ОтображатьЗаголовок = Ложь;
	
	// Группа "Основные параметры учета"
	бг_ОсновныеПараметрыУчета = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
		ЭтотОбъект,
		"бг_ОсновныеПараметрыУчета",
		бг_ГруппаРеквизитыНСИПраво);
	бг_ОсновныеПараметрыУчета.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	бг_ОсновныеПараметрыУчета.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	бг_ОсновныеПараметрыУчета.Заголовок = НСтр("ru = 'Основные параметры учета'");
	бг_ОсновныеПараметрыУчета.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	
	бг_Состояние = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Состояние",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_Состояние");
	бг_Состояние.АвтоМаксимальнаяШирина = Ложь;
	бг_Состояние.МаксимальнаяШирина = 28;
	
	бг_КодНСИ = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КодНСИ",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_КодНСИ");
	бг_КодНСИ.АвтоМаксимальнаяШирина = Ложь;
	бг_КодНСИ.МаксимальнаяШирина = 16;
	
	бг_Артикул = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Артикул",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_Артикул");
	бг_Артикул.АвтоМаксимальнаяШирина = Ложь;
	бг_Артикул.МаксимальнаяШирина = 16;
	
	бг_Предшественник = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Предшественник",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_Предшественник");
	бг_Предшественник.АвтоМаксимальнаяШирина = Ложь;
	бг_Предшественник.МаксимальнаяШирина = 29;
	
	бг_ПромоНаборСобственнойСборки = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ПромоНаборСобственнойСборки",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_ПромоНаборСобственнойСборки",
		, //ТипЭлемента
		, //Элемент
		"ПолеФлажка");
	бг_ПромоНаборСобственнойСборки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	бг_ВПодарочнойУпаковке = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ВПодарочнойУпаковке",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_ВПодарочнойУпаковке",
		, //ТипЭлемента
		, //Элемент
		"ПолеФлажка");
	бг_ВПодарочнойУпаковке.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	бг_Статус = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Статус",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_Статус");
	бг_Статус.АвтоМаксимальнаяШирина = Ложь;
	бг_Статус.МаксимальнаяШирина = 29;
	
	бг_СкюМТ = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_СкюМТ",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_СкюМТ");
	бг_СкюМТ.АвтоМаксимальнаяШирина = Ложь;
	бг_СкюМТ.МаксимальнаяШирина = 29;
	
	бг_ЕдиницаИзмерения = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ЕдиницаИзмерения",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_ЕдиницаИзмерения");
	бг_ЕдиницаИзмерения.АвтоМаксимальнаяШирина = Ложь;
	бг_ЕдиницаИзмерения.МаксимальнаяШирина = 29;
	
	бг_БрендКУ = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_БрендКУ",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_БрендКУ");
	бг_БрендКУ.АвтоМаксимальнаяШирина = Ложь;
	бг_БрендКУ.МаксимальнаяШирина = 29;
	
	бг_КатегорияМотивации = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КатегорияМотивации",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_КатегорияМотивации");
	бг_КатегорияМотивации.АвтоМаксимальнаяШирина = Ложь;
	бг_КатегорияМотивации.МаксимальнаяШирина = 29;
	
	бг_КатегорияВладельца = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КатегорияВладельца",
		бг_ОсновныеПараметрыУчета,
		"Объект.бг_КатегорияВладельца");
	бг_КатегорияВладельца.АвтоМаксимальнаяШирина = Ложь;
	бг_КатегорияВладельца.МаксимальнаяШирина = 29;
	
	бг_ГруппаОбъемДоляСпирта = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
		ЭтотОбъект,
		"бг_ГруппаОбъемДоляСпирта",
		бг_ОсновныеПараметрыУчета);
	бг_ГруппаОбъемДоляСпирта.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	бг_ГруппаОбъемДоляСпирта.ОтображатьЗаголовок = Ложь;
	
	бг_Объем = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Объем",
		бг_ГруппаОбъемДоляСпирта,
		"Объект.бг_Объем");
	бг_Объем.АвтоМаксимальнаяШирина = Ложь;
	бг_Объем.МаксимальнаяШирина = 10;
	
	бг_ДоляСпирта = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ДоляСпирта",
		бг_ГруппаОбъемДоляСпирта,
		"Объект.бг_ДоляСпирта");
	бг_ДоляСпирта.АвтоМаксимальнаяШирина = Ложь;
	бг_ДоляСпирта.МаксимальнаяШирина = 7;
	
	бг_ДоляСпиртаДо = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ДоляСпиртаДо",
		бг_ГруппаОбъемДоляСпирта,
		"Объект.бг_ДоляСпиртаДо");
	бг_ДоляСпиртаДо.АвтоМаксимальнаяШирина = Ложь;
	бг_ДоляСпиртаДо.МаксимальнаяШирина = 7;
	
	// Группа "Сведения о производителе"
	бг_ГруппаСведенияОПроизводителе = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
		ЭтотОбъект,
		"бг_ГруппаСведенияОПроизводителе",
		бг_ГруппаРеквизитыНСИПраво);
	бг_ГруппаСведенияОПроизводителе.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	бг_ГруппаСведенияОПроизводителе.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	бг_ГруппаСведенияОПроизводителе.Заголовок = НСтр("ru = 'Сведения о производителе'");
	бг_ГруппаСведенияОПроизводителе.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	
	бг_РегионПроисхождения = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_РегионПроисхождения",
		бг_ГруппаСведенияОПроизводителе,
		"Объект.бг_РегионПроисхождения");
	бг_РегионПроисхождения.АвтоМаксимальнаяШирина = Ложь;
	бг_РегионПроисхождения.МаксимальнаяШирина = 26;
	
	бг_НаЭкспорт = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_НаЭкспорт",
		бг_ГруппаСведенияОПроизводителе,
		"Объект.бг_НаЭкспорт",
		, //ТипЭлемента
		, //Элемент
		"ПолеФлажка");
	бг_НаЭкспорт.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	#КонецОбласти
	
	бг_ДегустационныеХарактеристики = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ДегустационныеХарактеристики",
		, //Родитель
		"Объект.бг_ДегустационныеХарактеристики");
	бг_ДегустационныеХарактеристики.АвтоМаксимальнаяШирина = Ложь;
	бг_ДегустационныеХарактеристики.МногострочныйРежим = Истина;
	бг_ДегустационныеХарактеристики.РастягиватьПоГоризонтали = Истина;
	бг_ДегустационныеХарактеристики.РастягиватьПоВертикали = Ложь;
	
	бг_Рейтинги = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Рейтинги",
		, //Родитель
		"Объект.бг_Рейтинги");
	бг_Рейтинги.АвтоМаксимальнаяШирина = Ложь;
	бг_Рейтинги.МногострочныйРежим = Истина;
	бг_Рейтинги.РастягиватьПоГоризонтали = Истина;
	бг_Рейтинги.РастягиватьПоВертикали = Ложь;
	
	бг_СортовойСостав = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_СортовойСостав",
		, //Родитель
		"Объект.бг_СортовойСостав");
	бг_СортовойСостав.АвтоМаксимальнаяШирина = Ложь;
	бг_СортовойСостав.МногострочныйРежим = Истина;
	бг_СортовойСостав.РастягиватьПоГоризонтали = Истина;
	бг_СортовойСостав.РастягиватьПоВертикали = Ложь;
	
	бг_Добавлен = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Добавлен",
		, //Родитель
		"Объект.бг_Добавлен");
	
	бг_Выбыл = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Выбыл",
		, //Родитель
		"Объект.бг_Выбыл");
	
КонецПроцедуры

Процедура бг_ВидимостьПолябг_ДоляСпиртаДо(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		бг_Класс = Объект.бг_Класс;
	Иначе
		бг_Класс = ТекущийОбъект.бг_Класс;
	КонецЕсли;
	
	#Если Клиент Тогда
		КлассИмеетДиапазонКрепостей = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(бг_Класс, "КлассИмеетДиапазонКрепостей");
	#Иначе
		КлассИмеетДиапазонКрепостей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(бг_Класс, "КлассИмеетДиапазонКрепостей");
	#КонецЕсли
	
	Если КлассИмеетДиапазонКрепостей = Неопределено Тогда
		КлассИмеетДиапазонКрепостей = Ложь;
	КонецЕсли;
	
	Элементы.бг_ДоляСпиртаДо.Видимость = КлассИмеетДиапазонКрепостей;
	
КонецПроцедуры

&НаСервере
Процедура бг_БрендПриИзмененииНаСервере()
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.бг_Бренд, "бг_БрендКУ,бг_КатегорияМотивации,бг_КатегорияВладельца");
	ЗаполнитьЗначенияСвойств(Объект, ЗначенияРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура бг_УстановитьАвтоОтметкуНезаполненногоВкус()
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.бг_Класс, "НеПроверятьОбъем");
	
	Если ЗначенияРеквизитов.НеПроверятьОбъем <> Неопределено Тогда 
		Элементы.бг_Вкус.АвтоОтметкаНезаполненного = НЕ ЗначенияРеквизитов.НеПроверятьОбъем;
		Элементы.бг_Вкус.ОтметкаНезаполненного 	   = НЕ ЗначенияРеквизитов.НеПроверятьОбъем;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
